# Pandas
An excellent package for data analysis:

1. Allows the use of labels for rows and columns
2. Can calculate rolling statistics on time series data
3. Easy handling of NaN values
4. Is able to load data of different formats into DataFrames
5. Can join and merge different datasets together
6. It integrates with NumPy and Matplotlib

In [179]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\ghimi\appdata\local\programs\python\python312\lib\site-packages (2.1.3)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\users\ghimi\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ghimi\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\ghimi\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\ghimi\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\ghimi\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [180]:
import pandas as pd
groceries = pd.Series(data=[30, 6, 'Yes', 'No'], index=['eggs', 'apples', 'milk', 'bread'])
print(groceries)

print("Shape: ",groceries.shape)
print("ndim: ",groceries.ndim)
print("Size: ",groceries.size)
print("Values: ",groceries.values)
print("Index: ",groceries.index)

eggs       30
apples      6
milk      Yes
bread      No
dtype: object
Shape:  (4,)
ndim:  1
Size:  4
Values:  [30 6 'Yes' 'No']
Index:  Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

In [181]:
"banana" in groceries

False

In [182]:
# Accessing and Deleting Elements in Pandas Series
print(groceries['eggs'])
print(groceries[['milk', 'bread']])

30
milk     Yes
bread     No
dtype: object

In [183]:
# loc is location based indexing
print(groceries.loc[['eggs', 'apples']])
print()

# iloc is index based indexing
print(groceries.iloc[[2, 3]])
print()

eggs      30
apples     6
dtype: object

milk     Yes
bread     No
dtype: object

In [184]:
# Slicing Pandas Series
print(groceries['eggs':'milk'])
print()
print(groceries[0:2])
print()

# Deleting Elements in Pandas Series
print(groceries.drop('apples'))
print()

# Deleting Elements in Pandas Series without inplace
groceries.drop('eggs', inplace=True)
print(groceries)

eggs       30
apples      6
milk      Yes
dtype: object

eggs      30
apples     6
dtype: object

eggs      30
milk     Yes
bread     No
dtype: object

apples      6
milk      Yes
bread      No
dtype: object

In [185]:
# * is used to multiply the values in the series by 2 and for string it will repeat the string twice
groceries * 2

apples        12
milk      YesYes
bread       NoNo
dtype: object

In [186]:
fruits * 2

apples         20
oranges        12
bananas         6
milk       YesYes
bread           2
dtype: object

In [187]:
import pandas as pd

# DO NOT CHANGE THE VARIABLE NAMES

# Given a list representing a few planets
planets = ['Earth', 'Saturn', 'Venus', 'Mars', 'Jupiter']

# Given another list representing the distance of each of these planets from the Sun
# The distance from the Sun is in units of 10^6 km
distance_from_sun = [149.6, 1433.5, 108.2, 227.9, 778.6]

# TO DO: Create a Pandas Series "dist_planets" using the lists above, representing the distance of the planet from the Sun.
# Use the `distance_from_sun` as your data, and `planets` as your index.
dist_planets = pd.Series(data = distance_from_sun, index= planets)

# TO DO: Calculate the time (minutes) it takes light from the Sun to reach each planet. 
# You can do this by dividing each planet's distance from the Sun by the speed of light.
# Use the speed of light, c = 18, since light travels 18 x 10^6 km/minute.
time_light = dist_planets / 18

# TO DO: Use Boolean indexing to select only those planets for which sunlight takes less
# than 40 minutes to reach them.
close_planets = time_light[time_light < 40]

In [188]:
# Creating pandas DataFrame
import pandas as pd

items = {'Bob': pd.Series(data=[245, 25, 55], index=['bike', 'pants', 'watch']),
         'Alice': pd.Series(data=[40, 110, 500, 45], index=['book', 'glasses', 'bike', 'pants'])}

print(type(items))

<class 'dict'>

In [189]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [190]:
data = {'Bob': pd.Series(data=[245, 25, 55]), 
        'Alice': pd.Series(data=[40, 110, 500, 45])}

df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [191]:
print(shopping_carts.columns)
print(shopping_carts.index)
print(shopping_carts.values)
print(shopping_carts.shape)
print(shopping_carts.ndim)
print(shopping_carts.size)

Index(['Bob', 'Alice'], dtype='object')
Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')
[[245. 500.]
 [ nan  40.]
 [ nan 110.]
 [ 25.  45.]
 [ 55.  nan]]
(5, 2)
2
10

In [192]:
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [193]:
sel_shopping_cart = pd.DataFrame(items, index=['pants', 'book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [194]:
data = {'Integers': [1, 2, 3],  
        'Floats': [4.5, 8.2, 9.6]}

df = pd.DataFrame(data, index=['label 1', 'label 2', 'label 3'])
df

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

In [195]:
# Accessing Elements in Pandas DataFrame
print(shopping_carts[['Bob']])
print()

print(shopping_carts.loc[['pants']])
print()

# First column then row
print(shopping_carts['Bob']['pants'])
print()

shopping_carts['suit'] = shopping_carts['Bob'] + shopping_carts['Alice']
shopping_carts

           Bob
bike     245.0
book       NaN
glasses    NaN
pants     25.0
watch     55.0

        Bob  Alice
pants  25.0   45.0

25.0

           Bob  Alice   suit
bike     245.0  500.0  745.0
book       NaN   40.0    NaN
glasses    NaN  110.0    NaN
pants     25.0   45.0   70.0
watch     55.0    NaN    NaN

In [196]:
# Create a row to be added to the DataFrame
data = {'Bob': 30, 'Alice': 40, 'Jake': 45}
new_shopping_cart = pd.DataFrame(data, index=['orange', 'apple', 'banana'])
new_shopping_cart

# Append the row to the DataFrame
items = [{'bikes': 20, 'pants': 30, 'watches': 35}, {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]
store_items = pd.DataFrame(items, index=['store 1', 'store 2'])
store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

In [197]:
# We create a dictionary from a list of Python dictionaries that will contain the number of different items at the new store
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

# We create new DataFrame with the new_items and provide and index labeled store 3
new_store = pd.DataFrame(new_items, index = ['store 3'])

# We display the items at the new store
new_store

         bikes  pants  watches  glasses
store 3     20     30       35        4

In [198]:
# Delete rows and columns from DataFrame
store_items = store_items.drop(['watches'], axis=1)
store_items

         bikes  pants  glasses
store 1     20     30      NaN
store 2     15      5     50.0

In [199]:
# We insert a new column with label shoes right before the column with numerical index 4
store_items.insert(1, 'shirts', [8,0])

# we display the modified DataFrame
store_items

         bikes  shirts  pants  glasses
store 1     20       8     30      NaN
store 2     15       0      5     50.0

In [200]:
# We remove the new watches column
store_items.pop('bikes')

# we display the modified DataFrame
store_items

# We remove the store 1 row
store_items = store_items.drop(['store 1'], axis = 0)

# we display the modified DataFrame
store_items

         shirts  pants  glasses
store 2       0      5     50.0

In [204]:
# We change the column label bikes to hats
store_items = store_items.rename(columns = {'bikes': 'hats'})

# We change the row label from store 3 to last store
store_items = store_items.rename(index = {'store 2': 'last store'})

# We change the row index to be the data in the pants column
store_items = store_items.set_index('pants')

# we display the modified DataFrame
store_items

       shirts  glasses
pants
5           0     50.0

In [208]:
# Dealing with NaN
# We create a list of Python dictionaries
items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes': 8, 'suits':45}, 
         {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes': 5, 'suits':7}, 
         {'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes': 10}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items, index = ['store 1', 'store 2', 'store 3'])

x = store_items.isnull().sum().sum()
print(x)
x = store_items.isnull().sum()
print(x)
x = store_items.isnull()
print(x)

3
bikes      0
pants      0
watches    0
shirts     1
shoes      0
suits      1
glasses    1
dtype: int64
         bikes  pants  watches  shirts  shoes  suits  glasses
store 1  False  False    False   False  False  False     True
store 2  False  False    False   False  False  False    False
store 3  False  False    False    True  False   True    False

In [209]:
store_items.count()

bikes      3
pants      3
watches    3
shirts     2
shoes      3
suits      2
glasses    2
dtype: int64

In [210]:
store_items.dropna(axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 2     15      5       10     2.0      5    7.0     50.0

In [211]:
store_items.dropna(axis=1)

         bikes  pants  watches  shoes
store 1     20     30       35      8
store 2     15      5       10      5
store 3     20     30       35     10

In [212]:
store_items.fillna(0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      0.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     0.0     10    0.0      4.0

In [213]:
# method='ffill' replaces the missing values with the values in the previous row
store_items.fillna(method='ffill', axis=0)

C:\Users\ghimi\AppData\Local\Temp\ipykernel_19988\1075998266.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  store_items.fillna(method='ffill', axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

In [214]:
# method = 'backfill' replaces the missing values with the value in the next row
store_items.fillna(method='backfill', axis=0)

C:\Users\ghimi\AppData\Local\Temp\ipykernel_19988\2434433959.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  store_items.fillna(method='backfill', axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0     50.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [215]:
store_items.interpolate(method='linear', axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

In [ ]:
import pandas as pd
import numpy as np

# DO NOT CHANGE THE VARIABLE NAMES

# Set the precision of our dataframes to one decimal place.
pd.set_option('precision', 1)

# Create a Pandas DataFrame that contains the ratings some users have given to a series of books. 
# The ratings given are in the range from 1 to 5, with 5 being the best score. 
# The names of the books, the corresponding authors, and the ratings of each user are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

# User ratings are in the order of the book titles mentioned above
# If a user has not rated all books, Pandas will automatically consider the missing values as NaN.
# If a user has mentioned `np.nan` value, then also it means that the user has not yet rated that book.
user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

# Use the data above to create a Pandas DataFrame that has the following column
# labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'. 
# Let Pandas automatically assign numerical row indices to the DataFrame. 

# TO DO: Create a dictionary with the data given above
dat = {'Author': authors, 'Book Title': books, 'User 1': user_1, 'User 2': user_2, 'User 3': user_3, 'User 4': user_4}

# TO DO: Create a Pandas DataFrame using the dictionary created above
book_ratings = pd.DataFrame(dat)

# TO DO:
# If you created the dictionary correctly you should have a Pandas DataFrame
# that has column labels: 
# 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4' 
# and row indices 0 through 4.

# Now replace all the NaN values in your DataFrame with the average rating in
# each column. Replace the NaN values in place. 
# HINT: Use the `pandas.DataFrame.fillna(value, inplace = True)` function for substituting the NaN values. 
# Write your code below:

book_ratings.fillna(book_ratings.mean(), inplace=True)

In [223]:
# Load data into Pandas DataFrame
Google_stock = pd.read_csv('GOOG.csv')

# We print some information about Google_stock
print('Google_stock is of type:', type(Google_stock))
print('Google_stock has shape:', Google_stock.shape)

# We display the first 5 rows of Google_stock using the .head() method
print(Google_stock.head())
print()

# We display the last 5 rows of Google_stock using the .tail() method
print(Google_stock.tail())
print()

# Check if  any column contains NaN values.
print(Google_stock.isnull().any())
print()

# We get descriptive statistics on our stock data
Google_stock.describe()

Google_stock is of type: <class 'pandas.core.frame.DataFrame'>
Google_stock has shape: (3313, 7)
         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200
3  2004-08-24  55.260582  55.439419  51.450363  52.096165  52.096165  15361800
4  2004-08-25  52.140873  53.651051  51.604362  52.657513  52.657513   9257400

            Date        Open        High         Low       Close   Adj Close  \
3308  2017-10-09  980.000000  985.424988  976.109985  977.000000  977.000000
3309  2017-10-10  980.000000  981.570007  966.080017  972.599976  972.599976
3310  2017-10-11  973.719971  990.710022  972.250000  989.250000  989.250000
3311  2017-10-12  987.450012  994.119995  985.000000  987.830017  987.830017
3312  2017-10-13  992.000000  997.210022  989.000000  989.679993  989.679993

       Volume
3308   891400
3309   968400
3310  1693300
3311  1262400
3312  1157700

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

,Open,High,Low,Close,Adj Close,Volume
count,3313.000000,3313.000000,3313.000000,3313.000000,3313.000000,3.313000e+03
mean,380.186092,383.493740,376.519309,380.072458,380.072458,8.038476e+06
std,223.818650,224.974534,222.473232,223.853780,223.853780,8.399521e+06
min,49.274517,50.541279,47.669952,49.681866,49.681866,7.900000e+03
25%,226.556473,228.394516,224.003082,226.407440,226.407440,2.584900e+06
50%,293.312286,295.433502,289.929291,293.029114,293.029114,5.281300e+06
75%,536.650024,540.000000,532.409973,536.690002,536.690002,1.065370e+07
max,992.000000,997.210022,989.000000,989.679993,989.679993,8.276810e+07

In [227]:
print(Google_stock['Adj Close'].describe())
print()

print(Google_stock.max())
print()

count    3313.000000
mean      380.072458
std       223.853780
min        49.681866
25%       226.407440
50%       293.029114
75%       536.690002
max       989.679993
Name: Adj Close, dtype: float64

Date         2017-10-13
Open              992.0
High         997.210022
Low               989.0
Close        989.679993
Adj Close    989.679993
Volume         82768100
dtype: object

In [229]:
# Group data using groupby
# We load fake Company data in a DataFrame
data = pd.read_csv('fake-company.csv')
data

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991   Dakota         HR   26   52000
4  1991     Elsa         RD   31   50000
5  1991    Frank      Admin   46   60000
6  1992    Grace      Admin   27   60000
7  1992  Hoffman         RD   32   52000
8  1992    Inaar      Admin   28   62000

In [233]:
# Group by one column
print(data.groupby(['Year'])['Salary'].sum())
print()
print(data.groupby(['Year'])['Age'].mean())

# Group by two columns
print(data.groupby(['Year', 'Department'])['Salary'].sum())

Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

Year
1990    33.333333
1991    34.333333
1992    29.000000
Name: Age, dtype: float64

In [ ]:
# Now that we have unique column labels, we can join the individual DataFrames to the all_stocks DataFrame. For this we will use the dataframe.join() function. The function dataframe1.join(dataframe2) joins dataframe1 with dataframe2. We will join each dataframe one by one to the all_stocks dataframe. Fill in the code below to join the dataframes, the first join has been made for you:
# We join the Google_stock dataframe with the all_stocks dataframe. We are joining on the Date column and we are choosing to do a left join.

# We join the Google stock to all_stocks
all_stocks = all_stocks.join(Google_stock, how='left', rsuffix='_Google')

# We join the Apple stock to all_stocks
all_stocks = all_stocks.join(Apple_stock, how='left', rsuffix='_Apple')

# We join the Amazon stock to all_stocks
all_stocks = all_stocks.join(Amazon_stock, how='left', rsuffix='_Amazon')

# solve columns overlap but no suffix specified: Index(['Date', 'Open', 'High', 'Low', 'Close', 'Volume'], dtype='object')